In [1]:
import pandas as pd
import numpy as np

<h1>EDA question 3

In [3]:
df = pd.read_csv('Dataset.csv')
df.head()

,Category,City,Country,Customer ID,Customer Name,Market,Order Date,Order ID,Order Priority,Product ID,...,Ship Date,Ship Mode,State,Sub-Category,Discount,Number of Records,Profit,Quantity,Sales,Shipping Cost
0,Office Supplies,Budapest,Hungary,AT-7352,Annie Thurman,EMEA,01-01-2011,HU-2011-1220,High,OFF-TEN-10001585,...,05-01-2011,Second Class,Budapest,Storage,0.0,1,29.640,4,66,8.17
1,Office Supplies,Stockholm,Sweden,EM-141402,Eugene Moren,EU,01-01-2011,IT-2011-3647632,High,OFF-PA-10001492,...,05-01-2011,Second Class,Stockholm,Paper,0.5,1,-26.055,3,45,4.82
2,Office Supplies,Constantine,Algeria,TB-112801,Toby Braunhardt,Africa,01-01-2011,AG-2011-2040,Medium,OFF-TEN-10000025,...,06-01-2011,Standard Class,Constantine,Storage,0.0,1,106.140,2,408,35.46
3,Furniture,Wagga Wagga,Australia,JH-159851,Joseph Holt,APAC,01-01-2011,IN-2011-47883,Medium,FUR-FU-10003447,...,08-01-2011,Standard Class,New South Wales,Furnishings,0.1,1,37.770,5,114,4.70
4,Office Supplies,Wagga Wagga,Australia,JH-159851,Joseph Holt,APAC,01-01-2011,IN-2011-47883,Medium,OFF-PA-10001968,...,08-01-2011,Standard Class,New South Wales,Paper,0.1,1,15.342,2,55,1.80

In [8]:
df['Order Date'].min()

'01-01-2011'

In [3]:
print(df.columns)
print(df.shape)

Index(['Category', 'City', 'Country', 'Customer ID', 'Customer Name', 'Market',
       'Order Date', 'Order ID', 'Order Priority', 'Product ID',
       'Product Name', 'Region', 'Row ID', 'Segment', 'Ship Date', 'Ship Mode',
       'State', 'Sub-Category', 'Discount', 'Number of Records', 'Profit',
       'Quantity', 'Sales', 'Shipping Cost'],
      dtype='object')
(51290, 24)

In [4]:
df['Customer ID'].nunique()

4873

In [12]:
df2 = df.groupby(['Customer ID']).aggregate({'Ship Date': ['min']})

In [13]:
df2.head()

              Ship Date
                    min
Customer ID
AA-103151    06-01-2014
AA-103152    07-08-2014
AA-103153    11-02-2013
AA-103154    05-04-2011
AA-103751    02-09-2012

In [18]:
df.columns

Index(['Category', 'City', 'Country', 'Customer ID', 'Customer Name', 'Market',
       'Order Date', 'Order ID', 'Order Priority', 'Product ID',
       'Product Name', 'Region', 'Row ID', 'Segment', 'Ship Date', 'Ship Mode',
       'State', 'Sub-Category', 'Discount', 'Number of Records', 'Profit',
       'Quantity', 'Sales', 'Shipping Cost'],
      dtype='object')

In [22]:
df['Joining date'] = df['Order Date']
for row in df.iterrows():
    row[1]['Joining date'] = df2.loc[row[1]['Customer ID']]

In [70]:
cID = df['Customer ID'].unique()
cID

array(['AT-7352', 'EM-141402', 'TB-112801', ..., 'DJ-34202', 'GH-46652',
       'LP-70951'], dtype=object)

In [78]:
dates = []
for i in range(len(df2)):
    dates.append(df2.iloc[i,0])
len(dates)

4873

In [79]:
dates = pd.to_datetime(dates,dayfirst=True)

In [80]:
dates

DatetimeIndex(['2014-01-06', '2014-08-07', '2013-02-11', '2011-04-05',
               '2012-09-02', '2014-01-02', '2013-07-01', '2012-02-05',
               '2014-09-01', '2012-09-02',
               ...
               '2014-03-05', '2014-09-03', '2014-06-03', '2012-10-04',
               '2014-06-05', '2013-12-03', '2012-11-05', '2015-01-04',
               '2012-12-03', '2011-09-01'],
              dtype='datetime64[ns]', length=4873, freq=None)

In [9]:
df['Quantity']

0        4
1        3
2        2
3        5
4        2
        ..
51285    2
51286    4
51287    5
51288    3
51289    3
Name: Quantity, Length: 51290, dtype: int64

<h1>Q6 RFM Analysis

<h2> Recency

In [11]:
df2 = df.groupby(['Customer ID']).agg({'Order Date' : ['max']})
df2.columns = list(map(''.join, df2.columns.values))
df2.head()

            Order Datemax
Customer ID
AA-103151      31-12-2013
AA-103152      27-11-2013
AA-103153      24-11-2011
AA-103154      31-03-2011
AA-103751      28-08-2012

In [12]:
df2.sort_values(by = 'Order Datemax',ascending = False,inplace = True)
df2.head()

            Order Datemax
Customer ID
SV-209352      31-12-2014
PO-188654      31-12-2014
EB-139753      31-12-2014
JM-155804      31-12-2014
LP-70951       31-12-2014

In [13]:
scores = []
no_cust = len(df2)
for i in range(no_cust):
    if (i+1)/no_cust <= 0.2:
        scores.append(5)
    elif (i+1)/no_cust <= 0.4:
        scores.append(4)
    elif (i+1)/no_cust <= 0.6:
        scores.append(3)
    elif (i+1)/no_cust <= 0.8:
        scores.append(2)
    else:
        scores.append(1)
scores = np.asarray(scores)
scores

array([5, 5, 5, ..., 1, 1, 1])

In [14]:
df2['Recency Score'] = scores
df2.head()

            Order Datemax  Recency Score
Customer ID
SV-209352      31-12-2014              5
PO-188654      31-12-2014              5
EB-139753      31-12-2014              5
JM-155804      31-12-2014              5
LP-70951       31-12-2014              5

<h2> Frequency

In [15]:
df.columns

Index(['Category', 'City', 'Country', 'Customer ID', 'Customer Name', 'Market',
       'Order Date', 'Order ID', 'Order Priority', 'Product ID',
       'Product Name', 'Region', 'Row ID', 'Segment', 'Ship Date', 'Ship Mode',
       'State', 'Sub-Category', 'Discount', 'Number of Records', 'Profit',
       'Quantity', 'Sales', 'Shipping Cost'],
      dtype='object')

In [16]:
dF = df[['Order Date','Customer ID']].groupby(['Customer ID']).min('Order Date')
dF.head()

             Order Date
Customer ID
AA-103151    04-07-2011
AA-103152    04-08-2014
AA-103153    05-02-2013
AA-103154    04-03-2013
AA-103751    07-10-2011

In [17]:
dF['Order Date'] = pd.to_datetime(dF['Order Date'])
base = min(dF['Order Date'])
dF['Order Date'] = [(epoch-base).total_seconds() for epoch in dF['Order Date']]

In [18]:
dF['Order Date'] = dF['Order Date'] + 1 
#TO avoid 0 base
dF['Order Date'].describe()

count    4.873000e+03
mean     6.813145e+07
std      3.618418e+07
min      1.000000e+00
25%      3.749760e+07
50%      7.171200e+07
75%      9.996480e+07
max      1.261440e+08
Name: Order Date, dtype: float64

In [19]:
no_of_purchases = df['Customer ID'].value_counts()

In [20]:
cID = dF.index
dF['frequency'] = no_of_purchases[cID]/dF['Order Date']

In [21]:
dF['frequency'].describe()

count    4.873000e+03
mean     6.978638e-03
std      3.051833e-01
min      7.927448e-09
25%      7.525406e-08
50%      1.432688e-07
75%      2.957371e-07
max      1.900000e+01
Name: frequency, dtype: float64

In [22]:
dF.sort_values(by = 'frequency',ascending = False,inplace = True)
dF['Scores'] = scores
dF.head()

             Order Date  frequency  Scores
Customer ID
JH-159851           1.0   19.00000       5
EM-141402           1.0    8.00000       5
AT-7352             1.0    5.00000       5
TB-112801           1.0    2.00000       5
GH-144852       86401.0    0.00022       5

<h2> Monetary Value

In [4]:
df['Sales'].describe()

count     51290
unique     2246
top          13
freq        589
Name: Sales, dtype: object

In [8]:
df['Sales'] = df['Sales'].str.replace(',','')
df['Sales'] = np.asarray(df['Sales'],dtype='float')

In [9]:
dM = df[['Sales','Customer ID']].groupby(['Customer ID']).sum('Sales')
print(dM.shape)
dM.head()

(4873, 1)

              Sales
Customer ID
AA-103151    1445.0
AA-103152    6105.0
AA-103153     633.0
AA-103154    5565.0
AA-103751    2407.0

In [10]:
dM.sort_values(by='Sales',ascending=False,inplace=True)
dM.head()

               Sales
Customer ID
SM-203204    25042.0
TC-209804    19050.0
CS-118451    16655.0
SP-209202    16566.0
VG-218051    15654.0

In [24]:
dM['Monetary Score'] = scores
dM.head()

               Sales  Monetary Score
Customer ID
SM-203204    25042.0               5
TC-209804    19050.0               5
CS-118451    16655.0               5
SP-209202    16566.0               5
VG-218051    15654.0               5

<h2> Combining scores to get the final RFM table